# VConstDivisionIndent Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PartMakerMethodToDivideVolumes..::..VConstDivisionIndent Property
PartMakerMethodToDivideVolumes Class See Also
---
Indentation for the application of division rule's pattern across v-const gridlines (i.e., similar to changing indices of v-const gridlines).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int VConstDivisionIndent { get; set; }
```

Visual Basic
---
```text
Public Property VConstDivisionIndent As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int VConstDivisionIndent {
	int get ();
	void set (int value);
}
```

# See Also
PartMakerMethodToDivideVolumes Class
Autodesk.Revit.DB Namespace